{"pages":[{"title":"关于我们","text":"Joint Us(加入我们) 团队以科学研究为导向，研究内容与实际应用紧密结合，注重学生能力培养。团队氛围自由学风浓厚，实验室设备齐全（包括图形工作站、大型服务器、高性能PC机若干）。尊重学生自主性，按学生意愿选择研究方向，时间分配自由无强制，对外学术交流机会充足。欢迎编程能力强、数学英语基础扎实有强烈科研兴趣的同学加入，有科研经历或学术成果者优先。欢迎联系！ Relevant Information(相关资料)","link":"/Contact/index.html"},{"title":"实验室成员","text":"信息融合与数据挖掘实验室(Information Fusion &amp; Data Mining Lab)隶属于重庆大学大数据与软件学院，目前共有成员14人，其中教师1名，硕士生9名，本科生3名，留学生1名。数年来，本实验室已毕业学生11人，其中博士1名，硕士10名。 以下为本实验室详细成员名单： 教师高旻(副教授) 学生大数据与软件学院学生：袁泉(2011.9-2013.12）腾讯公司崔丽艳（2012.9-2015.6）西南医院信息中心田仁丽（2013.9-2016.6）网易公司谭侃（2014.9-2017.6）湖南中国移动通信有限公司李祥（2014.9-2017.6）重庆锐明信息技术有限公司余俊良（2015.9-2018.6）澳大利亚昆士兰大学攻博宋宇琦（2016.9-）赵泽华（2017.9-）王昕毅（2017.9-）张峻伟（2018.9-）王润生（2018.9-） 汽车协同创新中心学生：钟浩文（2015.9-2018.6）长安汽车有限公司杨帆（2016.9-）卢珍妮（2017.9-）王宗威（2018.9-） 参与实验室科研项目学生：夏会(2012.6-2014.6) 澳大利亚重庆大学联合培养博士，重庆理工大学讲师黄海魂(2012.6-2014.6) 大众点评李文涛(2014.6-2016.12) 悉尼科技大学攻博窦桐 (2016.9-2018.6) 爱奇艺科技有限公司 学生获奖田仁丽（2013.9-2016.6）获2015年研究生国家奖学金 ￥20,000 （综评第一）谭侃（2014.9-2017.6）获2016年华为奖学金 （综评第三）余俊良（2015.9-2018.6）获2017年研究生国家奖学金 ￥20,000 （综评第一）宋宇琦（2016.9-）获2017年研究生国家奖学金 ￥20,000 （综评第一）赵泽华（2017.9-）获2018年研究生国家奖学金 ￥20,000 （综评第一）","link":"/Member/index.html"},{"title":"支撑项目","text":"Research(课题研究)[1] 国家自然科学基金，基于用户可信度的抗托攻击协同过滤推荐机理研究，71102065，主持[2] 中国博士后基金，基于项目时间序列异常检测的抗攻击协同过滤推荐研究，2012M521680，主持[3] 重庆市前沿与应用基础研究计划项目，基于多维社交关系挖掘的抗干扰社会化推荐研究，CSTC2015jcyjA40049，主持[4] 中央高校基金重点项目，多视图协同训练的托攻击检测研究，106112014CDJZR095502，主持[5] 智能检测监测云服务平台研发与示范应用，科技部国家重点研发计划（课题），主研[6] 在线交易可靠性监测与分析技术研究，科技部国家科技支撑计划项目，主研[7] 微波源功率实时智能控制理论与控制方法，科技部国家基础研究规划项目(973计划)，主研[8] 国家自然科学基金，基于异构服务网络分析的Web服务推荐研究, 61103114，主研 Projects(项目研究)[1] RecQ —— 推荐算法实验平台[2] Yue —— 音乐推荐算法实验平台[3] SDLib —— 托攻击检测实验平台[4] Datasets —— 数据集","link":"/Project/index.html"},{"title":"研究方向","text":"个性化推荐系统个性化推荐系统是互联网和电子商务发展的产物，它是建立在海量数据挖掘基础上的一种高级商务智能平台，向顾客提供个性化的信息服务和决策支持。推荐系统或推荐系统是信息过滤系统的子类，其寻求预测用户将给予项目的“评级”或“偏好”。推荐系统用于各种领域，包括电影，音乐，新闻，书籍，研究文章，搜索查询，社交标签和一般产品。 推荐系统通常以两种方式之一生成推荐列表，通过协同过滤或基于内容的过滤（也称为基于个性的方法）。协同过滤方法根据用户过去的行为（先前购买或选择的项目和/或给予这些项目的数字评级）以及其他用户做出的类似决策来构建模型。然后，该模型用于预测用户可能感兴趣的项目（或项目的评级）。基于内容的过滤方法利用项目的一系列离散特征，以推荐具有类似属性的其他项目。通常将这些方法结合起来（参见混合推荐系统）。 异常模式检测在数据挖掘中，异常检测（也是异常检测[1]）是通过与大多数数据显着不同而引起怀疑的罕见项目，事件或观察的识别。通常，异常项目将转化为某种问题，例如银行欺诈，结构缺陷，医疗问题或文本错误。异常也被称为异常值，新奇，噪声，偏差和例外。特别是，在滥用和网络入侵检测的背景下，有趣的对象通常不是罕见的对象，而是活动中的意外突发。这种模式不符合异常值的常见统计定义作为稀有对象，并且许多异常检测方法（特别是无监督方法）将在这些数据上失败，除非它已被适当地聚合。相反，聚类分析算法可能能够检测由这些模式形成的微聚类。 现存在三大类异常检测技术：监督模型、半监督模型和无监督模型。监督异常检测技术需要一个标记为“正常”和“异常”的数据集，并涉及训练分类器（与许多其他统计分类问题的关键区别在于异常检测的固有不平衡性质）；半监督异常检测技术构建表示来自给定正常训练数据集的正常行为的模型，然后测试由学习模型生成测试实例的可能性；无监督异常检测技术在假设数据集中的大多数实例通过查找似乎最接近数据集的其余部分的实例的情况下检测未标记的测试数据集中的异常。 社会媒体挖掘社交媒体挖掘是从社交媒体网站和移动应用上的用户生成内容获取大数据的过程，以便提取模式，形成关于用户的结论，并对信息采取行动，通常用于向用户做广告或进行研究。该术语类似于稀有矿物开采的资源开采过程。资源开采采矿要求矿业公司筛选大量原矿，以寻找宝贵的矿物; 同样，社交媒体挖掘需要人类数据分析师和自动化软件程序筛选大量原始社交媒体数据，以便识别与社交媒体使用，在线行为，内容共享，个人之间的联系，在线购买行为相关的模式和趋势甚至更多。 社交媒体挖掘使用计算机科学，数据挖掘，机器学习和统计学等一系列基本概念。社交媒体矿工开发适用于调查社交媒体数据的大量文件的算法。社交媒体挖掘基于社会网络分析，网络科学，社会学，优化和数学的理论和方法。","link":"/Direction/index.html"},{"title":"科研成果","text":"Conference Paper(会议论文)[1]. Junwei Zhang, Min Gao*, Junliang Yu, Xinyi Wang, Yuqi Song and Qingyu Xiong. “Nonlinear Transformation for Multiple Auxiliary Information in Music Recommendation” 2019 International Joint Conference on Neural Networks. (IJCNN 2019, CCF C).[2]. Zongwei Wang, Min Gao*, Xinyi Wang, Junliang Yu, Qingyu Xiong, Junhao Wen. “A Minimax Game for Generative and Discriminative Sample Models in Recommendation Systems” The 23rd Pacific-Asia Conference on Knowledge Discovery and Data Mining. (PAKDD 2019, CCF C).[3]. Junliang Yu, Min Gao*, Jundong Li, Hongzhi Yin, and Huan Liu. “Adaptive Implicit Friends Identification over Heterogeneous Network for Social Recommendation.” The 27th ACM International Conference on Information and Knowledge Management. (CIKM 2018, CCF B). [code][4]. Yuqi Song, Min Gao*, Junliang Yu and Qingyu Xiong. “Social Recommendation Based on Implicit Friends Discovering via Meta-Path.” The IEEE 29th International Conference on Tools with Artificial Intelligence. (ICTAI 2018, CCF C)[5]. Fan Yang, Min Gao*, Junliang Yu, Yuqi Song and Xinyi Wang. “Detection of Shilling Attack Based on Bayesian Model and User Embedding.” The IEEE 29th International Conference on Tools with Artificial Intelligence. (ICTAI 2018, CCF C) [code][6]. Siqi Xiang, Wenge Rong, Zhang Xiong, Min Gao, Qingyu Xiong, Visual and Audio Aware Bi-Modal Video Emotion Recognition, Proceedings of the 39th Annual Meeting of the Cognitive Science Society (CogSci 2017, CCF B)[7]. Yuqi Song, Min Gao*, Junliang Yu, Wentao Li, Junhao Wen, and Qingyu Xiong. “PUD: Social Spammer Detection Based on PU Learning.” International Conference on Neural Information Processing. Springer, 2017.11 (ICONIP 2017, CCF C).[8]. Junliang Yu, Min Gao*, Wenge Rong, Yuqi Song, Qianqi Fang, Qingyu Xiong. (2017). Make Users and Preferred Items Closer: Recommendation via Distance Metric Learning. International Conference on Neural Information Processing. Springer, 2017.11 (ICONIP 2017, CCF C).[9]. Junliang Yu, Min Gao*, Yuqi Song, Zehua Zhao, Wenge Rong, &amp; Qingyu Xiong. Connecting Factorization and Distance Metric Learning for Social Recommendations. Knowledge Science, Engineering and Management, Springer, Melbourne, Australia, 2017.08 (KSEM 2017, CCF C).[10]. Nan Jiang, Wenge Rong, Min Gao, Yikang Shen, Zhang Xiong(2017). Exploration of tree-based hierarchical Softmax for recurrent language models. In Twenty-Sixth International Joint Conference on Artificial Intelligence 2017,07 (IJCAI 2017, CCF A).[11]. Wentao Li, Min Gao*, Wenge Rong, Junhao Wen, Qingyu Xiong, Ruixi Jia and Tong Dou, Social Recommendation Using Euclidean Embedding,2017 International Joint Conference on Neural Networks (IJCNN), IEEE, Alaska, USA, 2017.05. (IJCNN 2017, CCF C) [code][12]. Xiang Li, Min Gao*, Wenge Rong, Qingyu Xiong, and Junhao Wen, Shilling Attacks Analysis in Collaborative Filtering Based Web Service Recommendation Systems, 2016 IEEE International Conference on Web Services (ICWS), San Francisco, US, 2016.06. (ICWS 2016, CCF B)[13]. Wentao Li, Min Gao*, Hua Li, Qingyu Xiong, Junhao Wen, and Zhongfu Wu, Dropout Prediction in MOOCs Using Behavior Features and Multi-view Semi-supervised Learning, International Joint Conference on Neural Networks, IEEE, Vancouver, Canada, 2016.07. (IJCNN 2016, CCF C)[14]. Wentao Li, Min Gao*, Wenge Rong, Junhao Wen, Qingyu Xiong, and Bin Ling, LSSL-SSD: Social Spammer Detection with Laplacian Score and Semi-supervised Learning, International Conference on Knowledge Science, Engineering and Management (KSEM), 2016, Springer, Passau, German. 2016.10. (KSEM 2016, CCF C)[15]. Feng Jiang, Min Gao*, Qingyu Xiong, Junhao Wen, and Yi Zhang, Robust Social Recommendation Techniques: A Review, Lecture Notes in Computer Science, the 17th International Conference on Informatics and Semiotics in Organisations (ICISO), São Paulo, Brazil, 2016.08. (EI)[16]. Liyan Cui, Min Gao, Qingyu Xiong, Junhao Wen, and Ning Xie, Temperature Monitoring Based on Image Processing for Intelligent Microwave Heating, Proceedings of the 2015 27th Chinese Control and Decision Conference, CCDC 2015,Qingdao, China, 2015.07. (EI)[17]. Min Gao* and Zhongfu Wu, EPN-based method for web service composition. Lecture Notes in Computer Science, 2009, 5854: 345-354. (EI)[18]. Min Gao* and Zhongfu Wu, Personalized Context-aware Collaborative Filtering based on Neural Network and Slope One, Lecture Notes in Computer Science, 2009, 5738: 109-116. (EI)[19]. Min Gao* and Zhongfu Wu, Incorporating pragmatic information in personalized recommendation systems, The 11th International Conference on Informatics and Semiotics in Organisations, 2009, Beijing, China, 156-164. (EI)[20]. Min Gao*, Zhongfu Wu, and Kecheng Liu, Pragmatic Grid for personalized resource provision, IEEE International Conference on Service Operations and Logistics, and Informatics, 2008: 1023-1028. (EI)[21]. Min Gao*, et al., An EPN-based method for web service composition, in Proceedings of the 2008 IEEE International Conference on Networking, Architecture, and Storage, 2008: 163-164. (EI) Journal Papers(期刊论文)[1]. Min Gao*, Bin Ling, Linda Yang, Junhao Wen, Qingyu Xiong, Shun Li, From Similarity Perspective: A Robust Collaborative Filtering Approach for Service Recommendations.Frontiers of Computer Science, 2018(5), 1-16. (SCI CCF C)[2]. Junliang Yu, Min Gao, Wenge Rong, Yuqi Song, Qingyu Xiong. A Social Recommender Based on Factorization and Distance Metric Learning.IEEE Access, 2017(5), 21557-21566. (SCI IF：3.557) [code][3]. Junliang Yu, Min Gao*, Wenge Rong, Wentao Li, Qingyu Xiong and Junhao Wen, Hybrid Attacks on Model-Based Social Recommender Systems. Physica A Statistical Mechanics &amp; Its Applications, 2017 (483), 171-181. (SCI impact factor：2.132)[4]. Min Gao*, Xiang Li, Wenge Rong, Lulan Yu, Xinyu Xiao, Junhao Wen and Qingyu Xiong, The Performance of Location Aware Shilling Attacks in Web Service Recommendation, International Journal of Web Services Research, 2017, 14(3): 53-66. (SCI)[5]. Wentao Li, Min Gao*, Hua Li, Jun Zeng, Qingyu Xiong, and Sachio Hirokawa, Shilling Attack Detection in Recommender Systems via Selecting Patterns Analysis, IEICE Transactions on Information and System, 2016, E99–D (10): 2600-2611. (SCI) [code][6]. 谭侃, 高旻*, 李文涛, 田仁丽, 文俊浩, 熊庆宇. 基于双层采样主动学习的社交网络虚假用户检测方法. 自动化学报, 2017, 43(3): 436-449. (EI)[7]. 李文涛, 高旻*，李华，熊庆宇，文俊浩，凌斌. 一种基于流行度分类特征的托攻击检测算法. 自动化学报, 2015 41 (9) 1563-1576. (EI)[8]. Min Gao*, Renli Tian, Junhao Wen, and Qingyu Xiong, Item Anomaly Detection Based on Dynamic Partition for Time Series in Recommender Systems, PLoS ONE 2015, 10(8) e0135155: 1-22. (SCI)[9]. Hui Xia, Bin Fang, Min Gao, Hui Ma, Yuanyan Tang, and Jing Wen. A novel item anomaly detection approach against shilling attacks in collaborative recommendation systems using the dynamic time interval segmentation technique, Information Sciences 306 (2015): 150-165. (SCI CCF B, IF: 4.305)[10]. Min Gao*, Quan Yuan, Bin Ling, and Qingyu Xiong, Detection of Abnormal Item Based on Time Intervals for Recommender Systems, The Scientific World Journal, 2014, 845897: 1-8. (SCI)[11]. Min Gao*, Bin Ling, Quan Yuan, Qingyu Xiong, and Linda Yang, A Robust Collaborative Filtering Approach Based on User Relationships for Recommendation Systems, Mathematical Problems in Engineering, 2014, 162521: 1-8. (SCI)[12]. Feng Jiang, Min Gao*, and Hui Xia, An Evaluation Approach Based on Word-of-Mouth for Trust Models in Recommendation Systems, Computer Modelling and New Technologies, 2014, 18(11): 605-609. (EI)[13]. Min Gao*, Yunqing Fu, Yixiong Chen, and Feng Jiang. User-Weight Model for Item-based Recommendation Systems, Journal of Software, 2012, 7(9): 2133-2140. (EI)[14]. Min Gao*, Yue Ma, Qingyu Xiong, Junhao Wen, Huixi Tan, and Chengliang Wang, Construction and Implementation of Surveillance System for Software Engineering Oriented Trainings, International Review on Computers and Software, 2012, 7(4): 1855-1859. (EI)[15]. Min Gao*, Zhongfu Wu, and Feng Jiang. “Userrank for item-based collaborative filtering recommendation.“ Information Processing Letters 111, no. 9 (2011): 440-446. (SCI CCF C)[16]. Min Gao*, Zhongfu Wu, and Feng Jiang, An Anti-“Shilling Attacks” Collaborative Filtering Algorithm Based on User Trust Ranks and Items, Journal of Chongqing University (Natural Science) 重庆大学学报（自然科学版）, 2011, 34(5): 135-142. (In Chinese) (EI)[17]. Min Gao* Kecheng Liu, and Zhongfu Wu. “Personalisation in web computing and informatics: Theories, techniques, applications, and future research.“ Information Systems Frontiers 12, no. 5 (2010): 607-629. (SCI IF：3.232)[18]. Min Gao* and Zhongfu Wu, Incorporating Personalized Contextual Information in Item-based Collaborative Filtering Recommendation. Journal of Software. 2010, 5(7): 729-736. (EI)[19]. Min Gao and Zhongfu Wu*, Personalized context and item based collaborative filtering recommendation, Journal of Southeast University (Natural Science) 东南大学学报（自然科学版）, 2009, 9(39): 27-31. (In Chinese) (EI)","link":"/Publication/index.html"}],"posts":[{"title":"Bulletin","text":"实验室论文被PAKDD 2019 录用：Zongwei Wang, Min Gao*, Xinyi Wang, Junliang Yu, Qingyu Xiong, Junhao Wen. “A Minimax Game for Generative and Discriminative Sample Models in Recommendation Systems”. PAKDD是亚太数据挖掘会议, （CCF C类学术会议），实验室王宗威同学参加了本次会议！","link":"/2019/04/16/bulletin/"},{"title":"bulletin1807","text":"一篇论文被数据挖掘顶级会议CIKM 2018（CCF B）接收 实验室论文被CIKM 2018 录用：Junliang Yu, Min Gao*, Jundong Li, Hongzhi Yin, and Huan Liu. “Adaptive Implicit Friends Identification over Heterogeneous Network for Social Recommendation.” CIKM是信息检索、知识管理和数据库领域中顶级的ACM会议, （CCF B类学术会议）！","link":"/2019/04/16/bulletin1807/"},{"title":"bulletin1808","text":"团队四名同学赴香港大学参与访学实践项目","link":"/2019/04/16/bulletin1808/"},{"title":"bulletin0415","text":"实验室一篇论文被IJCNN 2019 录用：Junwei Zhang, Min Gao*, Junliang Yu, Xinyi Wang, Yuqi Song and Qingyu Xiong. “Nonlinear Transformation for Multiple Auxiliary Information in Music Recommendation” . IJCNN是神经网络方面最重要的会议, （CCF C类学术会议）！","link":"/2019/04/16/bulletin0415/"},{"title":"Hello World","text":"实验室主页搭建完成！","link":"/2019/04/14/hello-world/"}],"tags":[],"categories":[]}